sentervip/stm32f105rbCAN4550/demo/TCAN4550Test/CAN/User/tcan-main.c
/*
 * main.c
 * Author: Texas Instruments
 * Date: 4/25/2019
 *
 * Description: A basic version of code to set up and receive a packet.
 *  - This is designed to work with the EVM the BOOSTXL-CANFD-LIN Rev 1.0 Boosterpack
 *  - It assumes TCAN4550 Oscillator of 40 MHz
 *  - Sets CAN arbitration rate at 500 kBaud
 *  - Sets CAN FD data phase for 2 MBaud
 *  - The interrupt pin is used for signal a received message, rather than polling
 *
 *   Pressing S1 will transmit a CAN message. S1 is on the MSP430FR6989 launchpad to the left.
 *
 *  Pinout
 *   - P1.4 SPI Clock / SCLK
 *   - P1.6 MOSI / SDI
 *   - P1.7 MISO / SDO
 *   - P2.5 SPI Chip Select / nCS
 *
 *   - P2.3 MCAN Interrupt 1 / nINT
 *   - Ground wire is important
 *
 *
 *
 * Copyright (c) 2019 Texas Instruments Incorporated.  All rights reserved.
 * Software License Agreement
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * Redistributions of source code must retain the above copyright
 * notice, this list of conditions and the following disclaimer.
 *
 * Redistributions in binary form must reproduce the above copyright
 * notice, this list of conditions and the following disclaimer in the
 * documentation and/or other materials provided with the
 * distribution.
 *
 * Neither the name of Texas Instruments Incorporated nor the names of
 * its contributors may be used to endorse or promote products derived
 * from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
 * A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
 * OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
 * SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
 * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
 * DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
 * THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include "stm32f10x.h"
#include "TCAN4550.h"

#define RCC_S1_PIN     RCC_APB2Periph_GPIOB 
#define PORT_S1_PIN     GPIOB
#define S1_PIN 					GPIO_Pin_12   
#define APP_S1_READ() GPIO_ReadInputDataBit(PORT_S1_PIN,S1_PIN)

#define RCC_RST_PIN     RCC_APB2Periph_GPIOC
#define PORT_RST_PIN     GPIOC
#define RST_PIN 					GPIO_Pin_2  

#define SET_RST_HIGH() GPIO_SetBits(PORT_RST_PIN,RST_PIN)
#define SET_RST_LOW() GPIO_ResetBits(PORT_RST_PIN,RST_PIN)



#define RCC_LED0_PIN      RCC_APB2Periph_GPIOA
#define PORT_LED0_PIN     GPIOA
#define LED0_PIN 					GPIO_Pin_15                 
#define LED_Off(LED0) 		GPIO_SetBits(PORT_LED0_PIN,LED0##_PIN);
#define LED_On(LED0) 			GPIO_ResetBits(PORT_LED0_PIN,LED0##_PIN);



#define RCC_INT_IN      	 RCC_APB2Periph_GPIOC
#define PORT_INT_IN      	 GPIOC

#define RCC_INT_TX_IN      RCC_APB2Periph_GPIOC
#define PORT_INT_TX_IN     GPIOC

#define RCC_INT_RX_IN      RCC_APB2Periph_GPIOC
#define PORT_INT_RX_IN		 GPIOC



// Interrupts
#define INT_IN			GPIO_Pin_4
#define INT_TX_IN		GPIO_Pin_1 
#define INT_RX_IN		GPIO_Pin_0 

#define APP_INT()		 (!GPIO_ReadInputDataBit(PORT_INT_IN,INT_IN))
#define APP_TX_INT()	(!GPIO_ReadInputDataBit(PORT_INT_TX_IN,INT_TX_IN))
#define APP_RX_INT()	(!GPIO_ReadInputDataBit(PORT_INT_RX_IN,INT_RX_IN))


void Init_GPIO(void);
void Init_Clock(void);
void Init_SPI(void);
void Init_CAN(void);

volatile uint8_t TCAN_Int_Cnt = 0;					// A variable used to keep track of interrupts the MCAN Interrupt pin
uint8_t tx_led_blink_flag = 0;

//LED1 处理程序
void Blink_Led_Process(void)
{
	static uint32_t time_out_count = 0;
	if(tx_led_blink_flag == 1)
	{
		time_out_count++;
		LED_On(LED0) ;
		
	}
	if(time_out_count >= 100000)
	{
		time_out_count = 0;
		tx_led_blink_flag = 0;
			LED_Off(LED0) ;
	}
}


			

int
main(void)
{
	uint32_t times=10000;
	uint32_t id_test=0;
	
	SET_RST_HIGH();
	while(times--);//上电等待一会
	SET_RST_LOW();

	Init_GPIO();									// Set up GPIOs for SPI and TCAN4550 connections
	Init_SPI();										// Initialize the SPI hardware module for 2 MHz SPI
	

				//硬件复位tcan4550芯片
	times=100000;
	SET_RST_HIGH();
	while(times--);//
	SET_RST_LOW();
	times=100000;
	while(times--);//

	id_test = AHB_READ_32(REG_SPI_DEVICE_ID0);
	if(id_test != 0x4E414354)
	{
		while(1);//SPI通信失败
	}
	


	
	/*********************************************
	 * Everything at this point is for TCAN4550  *
	 *********************************************/
	Init_CAN();										// Run the main MCAN configuration sequence. The bulk of the configuration is in this!
	


	/* Define the CAN message we want to send*/
	TCAN4x5x_MCAN_TX_Header header = {0};			// Remember to initialize to 0, or you'll get random garbage!
	uint8_t data[4] = {0x55, 0x66, 0x77, 0x88};		// Define the data payload
	header.DLC = MCAN_DLC_4B;						// Set the DLC to be equal to or less than the data payload (it is ok to pass a 64 byte data array into the WriteTXFIFO function if your DLC is 8 bytes, only the first 8 bytes will be read)
	header.ID = 0x144;								// Set the ID
	header.FDF = 1;									// CAN FD frame enabled
	header.BRS = 1;									// Bit rate switch enabled
	header.EFC = 0;
	header.MM  = 0;
	header.RTR = 0;
	header.XTD = 0;									// We are not using an extended ID in this example
	header.ESI = 0;									// Error state indicator


	TCAN4x5x_MCAN_WriteTXBuffer(0, &header, data);	// This function actually writes the header and data payload to the TCAN's MRAM in the specified TX queue number. It returns the bit necessary to write to TXBAR,
													// but does not necessarily require you to use it. In this example, we won't, so that we can send the data queued up at a later point.

	/* Let's make a different CAN message */
	data[0] = 0x11;
	data[1] = 0x22;
	data[2] = 0x33;
	data[3] = 0x44;									// Define the data payload

	header.DLC = MCAN_DLC_4B;						// Set the DLC to be equal to or less than the data payload (it is ok to pass a 64 byte data array into the WriteTXFIFO function if your DLC is 8 bytes, only the first 8 bytes will be read)
	header.ID = 0x123;								// Set the ID
	header.FDF = 1;									// CAN FD frame enabled
	header.BRS = 1;									// Bit rate switch enabled
	header.EFC = 0;
	header.MM  = 0;
	header.RTR = 0;
	header.XTD = 0;									// We are not using an extended ID in this example
	header.ESI = 0;									// Error state indicator

	TCAN4x5x_MCAN_WriteTXBuffer(1, &header, data);	// This line writes the data and header to TX FIFO 1
	TCAN4x5x_MCAN_TransmitBufferContents(1);		// Request that TX Buffer 1 be transmitted


	TCAN4x5x_MCAN_TransmitBufferContents(0);		// Now we can send the TX FIFO element 0 data that we had queued up earlier but didn't send.

	while (1)
	{
		Blink_Led_Process();
		
