sentervip/stm32f105rbCAN4550/demo/TCAN4550Test/CAN/User/tcan-main.c
		if (TCAN_Int_Cnt > 0 )
		{
			TCAN_Int_Cnt--;
			TCAN4x5x_Device_Interrupts dev_ir = {0};            // Define a new Device IR object for device (non-CAN) interrupt checking
			TCAN4x5x_MCAN_Interrupts mcan_ir = {0};				// Setup a new MCAN IR object for easy interrupt checking
			TCAN4x5x_Device_ReadInterrupts(&dev_ir);            // Read the device interrupt register
			TCAN4x5x_MCAN_ReadInterrupts(&mcan_ir);		        // Read the interrupt register

			if (dev_ir.SPIERR)                                  // If the SPIERR flag is set
			    TCAN4x5x_Device_ClearSPIERR();                  // Clear the SPIERR flag

			if (mcan_ir.RF0N)									// If a new message in RX FIFO 0
			{
				TCAN4x5x_MCAN_RX_Header MsgHeader = {0};		// Initialize to 0 or you'll get garbage
				uint8_t numBytes = 0;                           // Used since the ReadNextFIFO function will return how many bytes of data were read
				uint8_t dataPayload[64] = {0};                  // Used to store the received data

				TCAN4x5x_MCAN_ClearInterrupts(&mcan_ir);	    // Clear any of the interrupt bits that are set.

				numBytes = TCAN4x5x_MCAN_ReadNextFIFO( RXFIFO0, &MsgHeader, dataPayload);	// This will read the next element in the RX FIFO 0

				// numBytes will have the number of bytes it transfered in it. Or you can decode the DLC value in MsgHeader.DLC
				// The data is now in dataPayload[], and message specific information is in the MsgHeader struct.
				if (MsgHeader.ID == 0x0201)		// Example of how you can do an action based off a received address
				{
					if(dataPayload[0]==0x01)	//点亮LED
					{
						LED_On(LED0);
					}
					else
					{
						LED_Off(LED0);
					}
					// Do something
				}
			}
		}
	}
}

TCAN4x5x_MCAN_Nominal_Timing_Simple TCANNomTiming = {0};	// 500k arbitration with a 40 MHz crystal ((40E6 / 2) / (32 + 8) = 500E3)
TCAN4x5x_MCAN_Data_Timing_Simple TCANDataTiming = {0};		// 2 Mbps CAN FD with a 40 MHz crystal (40E6 / (15 + 5) = 2E6)
void TCAN4x5x_Set_Baudrate(uint16_t NomTiming,uint16_t DataTiming)
{
	switch(NomTiming)
	{
		case 50:
			TCANNomTiming.NominalBitRatePrescaler = 20;
				TCANNomTiming.NominalTqBeforeSamplePoint = 32;
				TCANNomTiming.NominalTqAfterSamplePoint = 8;
			break;
	case 100:
				TCANNomTiming.NominalBitRatePrescaler = 10;
				TCANNomTiming.NominalTqBeforeSamplePoint = 32;
				TCANNomTiming.NominalTqAfterSamplePoint = 8;
			break;
	case 125:
		TCANNomTiming.NominalBitRatePrescaler = 8;
				TCANNomTiming.NominalTqBeforeSamplePoint = 32;
				TCANNomTiming.NominalTqAfterSamplePoint = 8;
			break;
	case 250:
				TCANNomTiming.NominalBitRatePrescaler = 4;
				TCANNomTiming.NominalTqBeforeSamplePoint = 32;
				TCANNomTiming.NominalTqAfterSamplePoint = 8;
			break;
		case 500:
				TCANNomTiming.NominalBitRatePrescaler = 2;
				TCANNomTiming.NominalTqBeforeSamplePoint = 32;
				TCANNomTiming.NominalTqAfterSamplePoint = 8;
			break;
		case 800:
				TCANNomTiming.NominalBitRatePrescaler = 1;
				TCANNomTiming.NominalTqBeforeSamplePoint = 37;
				TCANNomTiming.NominalTqAfterSamplePoint = 13;
			break;
		case 1000:
				TCANNomTiming.NominalBitRatePrescaler = 1;
				TCANNomTiming.NominalTqBeforeSamplePoint = 30;
				TCANNomTiming.NominalTqAfterSamplePoint = 10;
			break;
	}
	
	
	switch(DataTiming)
	{
		case 1000:
			TCANDataTiming.DataBitRatePrescaler = 1;
			TCANDataTiming.DataTqBeforeSamplePoint = 30;
			TCANDataTiming.DataTqAfterSamplePoint = 10;
			break;
	case 2000:
				TCANDataTiming.DataBitRatePrescaler = 1;
			TCANDataTiming.DataTqBeforeSamplePoint = 15;
			TCANDataTiming.DataTqAfterSamplePoint = 5;
			break;
	case 3000:
				TCANDataTiming.DataBitRatePrescaler = 1;
			TCANDataTiming.DataTqBeforeSamplePoint = 9;
			TCANDataTiming.DataTqAfterSamplePoint = 4;
			break;
	case 4000:
					TCANDataTiming.DataBitRatePrescaler = 1;
			TCANDataTiming.DataTqBeforeSamplePoint = 7;
			TCANDataTiming.DataTqAfterSamplePoint = 3;
			break;
		case 5000:
				TCANDataTiming.DataBitRatePrescaler = 1;
			TCANDataTiming.DataTqBeforeSamplePoint = 6;
			TCANDataTiming.DataTqAfterSamplePoint = 2;
			break;
		case 8000:
				TCANDataTiming.DataBitRatePrescaler = 1;
			TCANDataTiming.DataTqBeforeSamplePoint = 3;
			TCANDataTiming.DataTqAfterSamplePoint = 2;
			break;
	}

	
}
	

/*
 * Configure the TCAN4550
 */
void
Init_CAN(void)
{
	
	
  TCAN4x5x_Device_ClearSPIERR();                              // Clear any SPI ERR flags that might be set as a result of our pin mux changing during MCU startup

    /* Step one attempt to clear all interrupts */
	TCAN4x5x_Device_Interrupt_Enable dev_ie = {0};				// Initialize to 0 to all bits are set to 0.
	TCAN4x5x_Device_ConfigureInterruptEnable(&dev_ie);	        // Disable all non-MCAN related interrupts for simplicity

	TCAN4x5x_Device_Interrupts dev_ir = {0};					// Setup a new MCAN IR object for easy interrupt checking
	TCAN4x5x_Device_ReadInterrupts(&dev_ir);					// Request that the struct be updated with current DEVICE (not MCAN) interrupt values

	if (dev_ir.PWRON)                                           // If the Power On interrupt flag is set
		TCAN4x5x_Device_ClearInterrupts(&dev_ir);               // Clear it because if it's not cleared within ~4 minutes, it goes to sleep

//设置波特率1M 8M
	TCAN4x5x_Set_Baudrate(1000,8000);

	/* Configure the MCAN core settings */
	TCAN4x5x_MCAN_CCCR_Config cccrConfig = {0};					// Remember to initialize to 0, or you'll get random garbage!
	cccrConfig.FDOE = 1;										// CAN FD mode enable
	cccrConfig.BRSE = 1;										// CAN FD Bit rate switch enable

	/* Configure the default CAN packet filtering settings */
	TCAN4x5x_MCAN_Global_Filter_Configuration gfc = {0};
	gfc.RRFE = 1;                                               // Reject remote frames (TCAN4x5x doesn't support this)
	gfc.RRFS = 1;                                               // Reject remote frames (TCAN4x5x doesn't support this)
	
//	gfc.ANFE = TCAN4x5x_GFC_REJECT;                // Default behavior if incoming message doesn't match a filter is to reject for extended ID messages (29 bit IDs)
//	gfc.ANFS = TCAN4x5x_GFC_REJECT;                // Default behavior if incoming message doesn't match a filter is to reject for standard ID messages (11 bit IDs)

	
	gfc.ANFE = TCAN4x5x_GFC_ACCEPT_INTO_RXFIFO0;                // Default behavior if incoming message doesn't match a filter is to accept into RXFIO0 for extended ID messages (29 bit IDs)
	gfc.ANFS = TCAN4x5x_GFC_ACCEPT_INTO_RXFIFO0;                // Default behavior if incoming message doesn't match a filter is to accept into RXFIO0 for standard ID messages (11 bit IDs)

	/* ************************************************************************
	 * In the next configuration block, we will set the MCAN core up to have:
	 *   - 1 SID filter element
	 *   - 1 XID Filter element
	 *   - 5 RX FIFO 0 elements
	 *   - RX FIFO 0 supports data payloads up to 64 bytes
	 *   - RX FIFO 1 and RX Buffer will not have any elements, but we still set their data payload sizes, even though it's not required
	 *   - No TX Event FIFOs
	 *   - 2 Transmit buffers supporting up to 64 bytes of data payload
	 */
	TCAN4x5x_MRAM_Config MRAMConfiguration = {0};
	MRAMConfiguration.SIDNumElements = 1;						// Standard ID number of elements, you MUST have a filter written to MRAM for each element defined
	MRAMConfiguration.XIDNumElements = 1;						// Extended ID number of elements, you MUST have a filter written to MRAM for each element defined
	MRAMConfiguration.Rx0NumElements = 5;						// RX0 Number of elements
	MRAMConfiguration.Rx0ElementSize = MRAM_64_Byte_Data;		// RX0 data payload size
	MRAMConfiguration.Rx1NumElements = 0;						// RX1 number of elements
	MRAMConfiguration.Rx1ElementSize = MRAM_64_Byte_Data;		// RX1 data payload size
	MRAMConfiguration.RxBufNumElements = 0;						// RX buffer number of elements
	MRAMConfiguration.RxBufElementSize = MRAM_64_Byte_Data;		// RX buffer data payload size
	MRAMConfiguration.TxEventFIFONumElements = 0;				// TX Event FIFO number of elements
	MRAMConfiguration.TxBufferNumElements = 2;					// TX buffer number of elements
	MRAMConfiguration.TxBufferElementSize = MRAM_64_Byte_Data;	// TX buffer data payload size


	/* Configure the MCAN core with the settings above, the changes in this block are write protected registers,      *
	 * so it makes the most sense to do them all at once, so we only unlock and lock once                             */

	TCAN4x5x_MCAN_EnableProtectedRegisters();					// Start by making protected registers accessible
	TCAN4x5x_MCAN_ConfigureCCCRRegister(&cccrConfig);			// Enable FD mode and Bit rate switching
	TCAN4x5x_MCAN_ConfigureGlobalFilter(&gfc);                  // Configure the global filter configuration (Default CAN message behavior)
	TCAN4x5x_MCAN_ConfigureNominalTiming_Simple(&TCANNomTiming);// Setup nominal/arbitration bit timing
	TCAN4x5x_MCAN_ConfigureDataTiming_Simple(&TCANDataTiming);	// Setup CAN FD timing
	TCAN4x5x_MRAM_Clear();										// Clear all of MRAM (Writes 0's to all of it)
	TCAN4x5x_MRAM_Configure(&MRAMConfiguration);				// Set up the applicable registers related to MRAM configuration
	TCAN4x5x_MCAN_DisableProtectedRegisters();					// Disable protected write and take device out of INIT mode


