sentervip/stm32f105rbCAN4550/demo/TCAN4550Test/CAN/User/tcan-main.c
}




/*
 * Initialize the EUSCI B SPI
 */
void Init_SPI()
{	
	SPI_InitTypeDef  SPI_InitStructure;
  GPIO_InitTypeDef GPIO_InitStructure;

  RCC_APB2PeriphClockCmd(RCC_APB2Periph_SPI1, ENABLE); 
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE); 
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIO_SPI_FLASH_CS, ENABLE); 

  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_5 | GPIO_Pin_6 | GPIO_Pin_7;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(GPIOA, &GPIO_InitStructure);
	

								  
  GPIO_InitStructure.GPIO_Pin = SPI_FALSH_CS_PIN;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(SPI_FALSH_CS_PORT, &GPIO_InitStructure);
	
	
//	 GPIO_SetBits(GPIOB, GPIO_Pin_12);
	
	
  SPI_FLASH_CS_HIGH();
  /* SPI2 Config -------------------------------------------------------------*/ 								  
  SPI_InitStructure.SPI_Direction = SPI_Direction_2Lines_FullDuplex;
  SPI_InitStructure.SPI_Mode = SPI_Mode_Master;
  SPI_InitStructure.SPI_DataSize = SPI_DataSize_8b;
  SPI_InitStructure.SPI_CPOL = SPI_CPOL_Low; 
  SPI_InitStructure.SPI_CPHA = SPI_CPHA_1Edge; 
  SPI_InitStructure.SPI_NSS = SPI_NSS_Soft;
  SPI_InitStructure.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_4;
  SPI_InitStructure.SPI_FirstBit = SPI_FirstBit_MSB;
  SPI_InitStructure.SPI_CRCPolynomial = 7;
  SPI_Init(SPI1, &SPI_InitStructure);
  /* Enable SPI1 */ 
  SPI_Cmd(SPI1, ENABLE); 
	
}


/*
 * S1按键中断处理程序
 */
void EXTI15_10_IRQHandler(void)
{
	
		if ( EXTI_GetITStatus(EXTI_Line12) != RESET ) 
		{
				
				tx_led_blink_flag = 1;
			
				EXTI_ClearITPendingBit(EXTI_Line12);
				TCAN4x5x_MCAN_TransmitBufferContents(0); 
			
			
		}
}



/*
 * CAN FD接收中断处理函数
 */
void EXTI4_IRQHandler(void)
{
	
		if ( EXTI_GetITStatus(EXTI_Line4) != RESET ) 
		{
				EXTI_ClearITPendingBit(EXTI_Line4);
				TCAN_Int_Cnt++;
		}
}
